In [2]:
import pandas as pd

In [4]:
df =pd.read_csv("HR_comma_sep.csv")
df.head(3)

,satisfaction_level,last_evaluation,number_project,average_montly_hours,time_spend_company,Work_accident,left,promotion_last_5years,Department,salary
0,0.38,0.53,2,157,3,0,1,0,sales,low
1,0.80,0.86,5,262,6,0,1,0,sales,medium
2,0.11,0.88,7,272,4,0,1,0,sales,medium

In [5]:
sub = df[['satisfaction_level' , 'average_montly_hours','promotion_last_5years','salary']]
sub.head(3)

   satisfaction_level  average_montly_hours  promotion_last_5years  salary
0                0.38                   157                      0     low
1                0.80                   262                      0  medium
2                0.11                   272                      0  medium

In [6]:
left = df[df.left==1]
left.shape

(3571, 10)

In [7]:
retained = df[df.left==0]
retained.shape

(11428, 10)

In [8]:
salary_dummies = pd.get_dummies(df.salary)
salary_dummies

       high  low  medium
0         0    1       0
1         0    0       1
2         0    0       1
3         0    1       0
4         0    1       0
...     ...  ...     ...
14994     0    1       0
14995     0    1       0
14996     0    1       0
14997     0    1       0
14998     0    1       0

[14999 rows x 3 columns]

In [12]:
salary_dummies.drop('medium' , axis = 'columns' , inplace = True)
salary_dummies

       high  low
0         0    1
1         0    0
2         0    0
3         0    1
4         0    1
...     ...  ...
14994     0    1
14995     0    1
14996     0    1
14997     0    1
14998     0    1

[14999 rows x 2 columns]

In [16]:
final = pd.concat([sub,salary_dummies] , axis = 'columns')
final.head(3)

,satisfaction_level,average_montly_hours,promotion_last_5years,salary,high,low
0,0.38,157,0,low,0,1
1,0.80,262,0,medium,0,0
2,0.11,272,0,medium,0,0

In [22]:
final.drop('salary' , axis='columns' , inplace = True)
final.head(3)

   satisfaction_level  average_montly_hours  promotion_last_5years  high  low
0                0.38                   157                      0     0    1
1                0.80                   262                      0     0    0
2                0.11                   272                      0     0    0

In [34]:
from sklearn import linear_model
rg = linear_model.LogisticRegression()

In [35]:
x = final
x.head(3)

   satisfaction_level  average_montly_hours  promotion_last_5years  high  low
0                0.38                   157                      0     0    1
1                0.80                   262                      0     0    0
2                0.11                   272                      0     0    0

In [36]:
y = df.left
y.head(3)

0    1
1    1
2    1
Name: left, dtype: int64

In [37]:
from sklearn.model_selection import train_test_split
x_test , x_train , y_test , y_train = train_test_split( x , y , train_size = 0.3)

In [44]:
rg.fit(x_train , y_train)

LogisticRegression()

In [49]:
rg.predict(x_test)

array([0, 0, 1, ..., 0, 1, 0], dtype=int64)

In [47]:
rg.score(x_test , y_test)

0.7706156923760836